{"class_name": "Model", "config": {"name": "model_2", "layers": [{"name": "input_12", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 622, 47], "dtype": "float32", "sparse": false, "name": "input_12"}, "inbound_nodes": []}, {"name": "masking_18", "class_name": "Masking", "config": {"name": "masking_18", "trainable": true, "batch_input_shape": [null, 622, 47], "dtype": "float32", "mask_value": 666}, "inbound_nodes": [[["input_12", 0, 0, {}]]]}, {"name": "dropout_93", "class_name": "Dropout", "config": {"name": "dropout_93", "trainable": true, "rate": 0.25, "noise_shape": [null, 1, 47], "seed": null}, "inbound_nodes": [[["masking_18", 0, 0, {}]]]}, {"name": "dense_97", "class_name": "Dense", "config": {"name": "dense_97", "trainable": true, "units": 34, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 3.0, "axis": 0}}, "bias_constraint": null}, "inbound_nodes": [[["dropout_93", 0, 0, {}]]]}, {"name": "batch_normalization_12", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_12", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["dense_97", 0, 0, {}]]]}, {"name": "bidirectional_159", "class_name": "Bidirectional", "config": {"name": "bidirectional_159", "trainable": true, "layer": {"class_name": "GRU", "config": {"name": "gru_139", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 32, "activation": "sigmoid", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 3.0, "axis": 0}}, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.5, "recurrent_dropout": 0.5, "implementation": 1, "reset_after": false}}, "merge_mode": "concat"}, "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]]}, {"name": "bidirectional_163", "class_name": "Bidirectional", "config": {"name": "bidirectional_163", "trainable": true, "layer": {"class_name": "GRU", "config": {"name": "gru_143", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 2, "activation": "sigmoid", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 3.0, "axis": 0}}, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.5, "recurrent_dropout": 0.5, "implementation": 1, "reset_after": false}}, "merge_mode": "concat"}, "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]]}, {"name": "bidirectional_167", "class_name": "Bidirectional", "config": {"name": "bidirectional_167", "trainable": true, "layer": {"class_name": "GRU", "config": {"name": "gru_147", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 64, "activation": "sigmoid", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 3.0, "axis": 0}}, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.5, "recurrent_dropout": 0.5, "implementation": 1, "reset_after": false}}, "merge_mode": "concat"}, "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]]}, {"name": "bidirectional_160", "class_name": "Bidirectional", "config": {"name": "bidirectional_160", "trainable": true, "layer": {"class_name": "GRU", "config": {"name": "gru_140", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 32, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 3.0, "axis": 0}}, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.5, "recurrent_dropout": 0.5, "implementation": 1, "reset_after": false}}, "merge_mode": "concat"}, "inbound_nodes": [[["bidirectional_159", 0, 0, {}]]]}, {"name": "bidirectional_164", "class_name": "Bidirectional", "config": {"name": "bidirectional_164", "trainable": true, "layer": {"class_name": "GRU", "config": {"name": "gru_144", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 2, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 3.0, "axis": 0}}, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.5, "recurrent_dropout": 0.5, "implementation": 1, "reset_after": false}}, "merge_mode": "concat"}, "inbound_nodes": [[["bidirectional_163", 0, 0, {}]]]}, {"name": "bidirectional_168", "class_name": "Bidirectional", "config": {"name": "bidirectional_168", "trainable": true, "layer": {"class_name": "GRU", "config": {"name": "gru_148", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 64, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 3.0, "axis": 0}}, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.5, "recurrent_dropout": 0.5, "implementation": 1, "reset_after": false}}, "merge_mode": "concat"}, "inbound_nodes": [[["bidirectional_167", 0, 0, {}]]]}, {"name": "dropout_94", "class_name": "Dropout", "config": {"name": "dropout_94", "trainable": true, "rate": 0.5, "noise_shape": [null, 1, 64], "seed": null}, "inbound_nodes": [[["bidirectional_160", 0, 0, {}]]]}, {"name": "dropout_96", "class_name": "Dropout", "config": {"name": "dropout_96", "trainable": true, "rate": 0.5, "noise_shape": [null, 1, 4], "seed": null}, "inbound_nodes": [[["bidirectional_164", 0, 0, {}]]]}, {"name": "dropout_98", "class_name": "Dropout", "config": {"name": "dropout_98", "trainable": true, "rate": 0.5, "noise_shape": [null, 1, 128], "seed": null}, "inbound_nodes": [[["bidirectional_168", 0, 0, {}]]]}, {"name": "dense_98", "class_name": "Dense", "config": {"name": "dense_98", "trainable": true, "units": 34, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 3.0, "axis": 0}}, "bias_constraint": null}, "inbound_nodes": [[["dropout_94", 0, 0, {}]]]}, {"name": "dense_100", "class_name": "Dense", "config": {"name": "dense_100", "trainable": true, "units": 34, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 3.0, "axis": 0}}, "bias_constraint": null}, "inbound_nodes": [[["dropout_96", 0, 0, {}]]]}, {"name": "dense_102", "class_name": "Dense", "config": {"name": "dense_102", "trainable": true, "units": 34, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 3.0, "axis": 0}}, "bias_constraint": null}, "inbound_nodes": [[["dropout_98", 0, 0, {}]]]}, {"name": "dense_104", "class_name": "Dense", "config": {"name": "dense_104", "trainable": false, "units": 34, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 3.0, "axis": 0}}, "bias_constraint": null}, "inbound_nodes": [[["dropout_93", 0, 0, {}]]]}, {"name": "dense_106", "class_name": "Dense", "config": {"name": "dense_106", "trainable": false, "units": 34, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 3.0, "axis": 0}}, "bias_constraint": null}, "inbound_nodes": [[["dropout_93", 0, 0, {}]]]}, {"name": "add_68", "class_name": "Add", "config": {"name": "add_68", "trainable": true}, "inbound_nodes": [[["batch_normalization_12", 0, 0, {}], ["dense_98", 0, 0, {}]]]}, {"name": "add_70", "class_name": "Add", "config": {"name": "add_70", "trainable": true}, "inbound_nodes": [[["batch_normalization_12", 0, 0, {}], ["dense_100", 0, 0, {}]]]}, {"name": "add_72", "class_name": "Add", "config": {"name": "add_72", "trainable": true}, "inbound_nodes": [[["batch_normalization_12", 0, 0, {}], ["dense_102", 0, 0, {}]]]}, {"name": "bidirectional_171", "class_name": "Bidirectional", "config": {"name": "bidirectional_171", "trainable": true, "layer": {"class_name": "GRU", "config": {"name": "gru_151", "trainable": false, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 32, "activation": "sigmoid", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 3.0, "axis": 0}}, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.5, "recurrent_dropout": 0.5, "implementation": 1, "reset_after": false}}, "merge_mode": "concat"}, "inbound_nodes": [[["dense_104", 0, 0, {}]]]}, {"name": "bidirectional_175", "class_name": "Bidirectional", "config": {"name": "bidirectional_175", "trainable": true, "layer": {"class_name": "GRU", "config": {"name": "gru_153", "trainable": false, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 32, "activation": "sigmoid", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 3.0, "axis": 0}}, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.5, "recurrent_dropout": 0.5, "implementation": 1, "reset_after": false}}, "merge_mode": "concat"}, "inbound_nodes": [[["dense_106", 0, 0, {}]]]}, {"name": "bidirectional_161", "class_name": "Bidirectional", "config": {"name": "bidirectional_161", "trainable": true, "layer": {"class_name": "GRU", "config": {"name": "gru_141", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 32, "activation": "sigmoid", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 3.0, "axis": 0}}, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.5, "recurrent_dropout": 0.5, "implementation": 1, "reset_after": false}}, "merge_mode": "concat"}, "inbound_nodes": [[["add_68", 0, 0, {}]]]}, {"name": "bidirectional_165", "class_name": "Bidirectional", "config": {"name": "bidirectional_165", "trainable": true, "layer": {"class_name": "GRU", "config": {"name": "gru_145", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 2, "activation": "sigmoid", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 3.0, "axis": 0}}, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.5, "recurrent_dropout": 0.5, "implementation": 1, "reset_after": false}}, "merge_mode": "concat"}, "inbound_nodes": [[["add_70", 0, 0, {}]]]}, {"name": "bidirectional_169", "class_name": "Bidirectional", "config": {"name": "bidirectional_169", "trainable": true, "layer": {"class_name": "GRU", "config": {"name": "gru_149", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 64, "activation": "sigmoid", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 3.0, "axis": 0}}, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.5, "recurrent_dropout": 0.5, "implementation": 1, "reset_after": false}}, "merge_mode": "concat"}, "inbound_nodes": [[["add_72", 0, 0, {}]]]}, {"name": "bidirectional_172", "class_name": "Bidirectional", "config": {"name": "bidirectional_172", "trainable": true, "layer": {"class_name": "GRU", "config": {"name": "gru_152", "trainable": false, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 32, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 3.0, "axis": 0}}, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.5, "recurrent_dropout": 0.5, "implementation": 1, "reset_after": false}}, "merge_mode": "concat"}, "inbound_nodes": [[["bidirectional_171", 0, 0, {}]]]}, {"name": "bidirectional_176", "class_name": "Bidirectional", "config": {"name": "bidirectional_176", "trainable": true, "layer": {"class_name": "GRU", "config": {"name": "gru_154", "trainable": false, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 32, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 3.0, "axis": 0}}, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.5, "recurrent_dropout": 0.5, "implementation": 1, "reset_after": false}}, "merge_mode": "concat"}, "inbound_nodes": [[["bidirectional_175", 0, 0, {}]]]}, {"name": "bidirectional_162", "class_name": "Bidirectional", "config": {"name": "bidirectional_162", "trainable": true, "layer": {"class_name": "GRU", "config": {"name": "gru_142", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 32, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 3.0, "axis": 0}}, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.5, "recurrent_dropout": 0.5, "implementation": 1, "reset_after": false}}, "merge_mode": "concat"}, "inbound_nodes": [[["bidirectional_161", 0, 0, {}]]]}, {"name": "bidirectional_166", "class_name": "Bidirectional", "config": {"name": "bidirectional_166", "trainable": true, "layer": {"class_name": "GRU", "config": {"name": "gru_146", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 2, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 3.0, "axis": 0}}, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.5, "recurrent_dropout": 0.5, "implementation": 1, "reset_after": false}}, "merge_mode": "concat"}, "inbound_nodes": [[["bidirectional_165", 0, 0, {}]]]}, {"name": "bidirectional_170", "class_name": "Bidirectional", "config": {"name": "bidirectional_170", "trainable": true, "layer": {"class_name": "GRU", "config": {"name": "gru_150", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 64, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 3.0, "axis": 0}}, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.5, "recurrent_dropout": 0.5, "implementation": 1, "reset_after": false}}, "merge_mode": "concat"}, "inbound_nodes": [[["bidirectional_169", 0, 0, {}]]]}, {"name": "bidirectional_173", "class_name": "Bidirectional", "config": {"name": "bidirectional_173", "trainable": true, "layer": {"class_name": "LSTM", "config": {"name": "lstm_21", "trainable": false, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 32, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 3.0, "axis": 0}}, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.5, "recurrent_dropout": 0.5, "implementation": 1}}, "merge_mode": "concat"}, "inbound_nodes": [[["bidirectional_172", 0, 0, {}]]]}, {"name": "bidirectional_177", "class_name": "Bidirectional", "config": {"name": "bidirectional_177", "trainable": true, "layer": {"class_name": "LSTM", "config": {"name": "lstm_23", "trainable": false, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 32, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 3.0, "axis": 0}}, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.5, "recurrent_dropout": 0.5, "implementation": 1}}, "merge_mode": "concat"}, "inbound_nodes": [[["bidirectional_176", 0, 0, {}]]]}, {"name": "dropout_95", "class_name": "Dropout", "config": {"name": "dropout_95", "trainable": true, "rate": 0.5, "noise_shape": [null, 1, 64], "seed": null}, "inbound_nodes": [[["bidirectional_162", 0, 0, {}]]]}, {"name": "dropout_97", "class_name": "Dropout", "config": {"name": "dropout_97", "trainable": true, "rate": 0.5, "noise_shape": [null, 1, 4], "seed": null}, "inbound_nodes": [[["bidirectional_166", 0, 0, {}]]]}, {"name": "dropout_99", "class_name": "Dropout", "config": {"name": "dropout_99", "trainable": true, "rate": 0.5, "noise_shape": [null, 1, 128], "seed": null}, "inbound_nodes": [[["bidirectional_170", 0, 0, {}]]]}, {"name": "bidirectional_174", "class_name": "Bidirectional", "config": {"name": "bidirectional_174", "trainable": true, "layer": {"class_name": "LSTM", "config": {"name": "lstm_22", "trainable": false, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 32, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 3.0, "axis": 0}}, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.5, "recurrent_dropout": 0.5, "implementation": 1}}, "merge_mode": "concat"}, "inbound_nodes": [[["bidirectional_173", 0, 0, {}]]]}, {"name": "bidirectional_178", "class_name": "Bidirectional", "config": {"name": "bidirectional_178", "trainable": true, "layer": {"class_name": "LSTM", "config": {"name": "lstm_24", "trainable": false, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 32, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 3.0, "axis": 0}}, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.5, "recurrent_dropout": 0.5, "implementation": 1}}, "merge_mode": "concat"}, "inbound_nodes": [[["bidirectional_177", 0, 0, {}]]]}, {"name": "dense_99", "class_name": "Dense", "config": {"name": "dense_99", "trainable": true, "units": 34, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 3.0, "axis": 0}}, "bias_constraint": null}, "inbound_nodes": [[["dropout_95", 0, 0, {}]]]}, {"name": "dense_101", "class_name": "Dense", "config": {"name": "dense_101", "trainable": true, "units": 34, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 3.0, "axis": 0}}, "bias_constraint": null}, "inbound_nodes": [[["dropout_97", 0, 0, {}]]]}, {"name": "dense_103", "class_name": "Dense", "config": {"name": "dense_103", "trainable": true, "units": 34, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 3.0, "axis": 0}}, "bias_constraint": null}, "inbound_nodes": [[["dropout_99", 0, 0, {}]]]}, {"name": "dropout_100", "class_name": "Dropout", "config": {"name": "dropout_100", "trainable": true, "rate": 0.5, "noise_shape": [null, 1, 64], "seed": null}, "inbound_nodes": [[["bidirectional_174", 0, 0, {}]]]}, {"name": "dropout_101", "class_name": "Dropout", "config": {"name": "dropout_101", "trainable": true, "rate": 0.5, "noise_shape": [null, 1, 64], "seed": null}, "inbound_nodes": [[["bidirectional_178", 0, 0, {}]]]}, {"name": "add_69", "class_name": "Add", "config": {"name": "add_69", "trainable": true}, "inbound_nodes": [[["add_68", 0, 0, {}], ["dense_99", 0, 0, {}]]]}, {"name": "add_71", "class_name": "Add", "config": {"name": "add_71", "trainable": true}, "inbound_nodes": [[["add_70", 0, 0, {}], ["dense_101", 0, 0, {}]]]}, {"name": "add_73", "class_name": "Add", "config": {"name": "add_73", "trainable": true}, "inbound_nodes": [[["add_72", 0, 0, {}], ["dense_103", 0, 0, {}]]]}, {"name": "dense_105", "class_name": "Dense", "config": {"name": "dense_105", "trainable": true, "units": 34, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 3.0, "axis": 0}}, "bias_constraint": null}, "inbound_nodes": [[["dropout_100", 0, 0, {}]]]}, {"name": "dense_107", "class_name": "Dense", "config": {"name": "dense_107", "trainable": true, "units": 34, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 3.0, "axis": 0}}, "bias_constraint": null}, "inbound_nodes": [[["dropout_101", 0, 0, {}]]]}, {"name": "concatenate_2", "class_name": "Concatenate", "config": {"name": "concatenate_2", "trainable": true, "axis": -1}, "inbound_nodes": [[["add_69", 0, 0, {}], ["add_71", 0, 0, {}], ["add_73", 0, 0, {}], ["dense_105", 0, 0, {}], ["dense_107", 0, 0, {}]]]}, {"name": "dense_108", "class_name": "Dense", "config": {"name": "dense_108", "trainable": true, "units": 7, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 3.0, "axis": 0}}, "bias_constraint": null}, "inbound_nodes": [[["concatenate_2", 0, 0, {}]]]}], "input_layers": [["input_12", 0, 0]], "output_layers": [["dense_108", 0, 0]]}, "keras_version": "2.2.0", "backend": "tensorflow"}